{
  "title": "2000+Vocab_301-350",
  "word_bank": [
    "assiduous", "encompassing", "ephemeral", "disparate", "disclose",
    "rouse", "remorse", "obligation", "correlated", "disdain",
    "epitome", "cantankerous", "belligerent", "polemical", "discouraged",
    "pervasive", "ubiquitous", "jeopardized", "perilous", "didactic",
    "impertinent", "vigorous", "deficient", "breed", "flamboyant",
    "opulent", "inane", "dispense", "tentative", "apprehensive",
    "lucid", "superfluous", "devoid", "luxuriant", "convivial",
    "amicable", "subdued", "orthodox", "devoted", "devotee",
    "connoisseur", "imperious", "disparity", "disdainful", "systematic",
    "obsequious", "belittle", "cryptic", "swindle", "buoy"
  ],
  "question_bank": {
    "assiduous": "She kept a daily log, reviewed errors each night, and never skipped practice. Her _____ effort improved her scores steadily over months.",
    "encompassing": "The survey was designed to be _____, covering diet, sleep, exercise, and stress. It aimed to include every major lifestyle factor, not just one.",
    "ephemeral": "The excitement after the announcement was _____ and faded by the next morning. The happiness was brief rather than lasting.",
    "disparate": "The committee had to compare _____ data sources, including interviews, lab values, and satellite images. The materials were very different in type and format.",
    "disclose": "He promised confidentiality but later chose to _____ the information to the press. He revealed it openly instead of keeping it hidden.",
    "rouse": "The loud alarm was enough to _____ everyone from sleep. It stirred them into action immediately.",
    "remorse": "After realizing he had lied, he felt genuine _____ and apologized without excuses. His regret was moral, not merely fear of punishment.",
    "obligation": "Even though she was tired, she stayed late because of her professional _____. She felt a duty that she could not ignore.",
    "correlated": "In the dataset, higher screen time was strongly _____ with shorter sleep duration. The two variables tended to move together.",
    "disdain": "He refused to read the article and dismissed it as beneath him. He treated it with open _____.",
    "epitome": "Her calm leadership during the crisis was the _____ of professionalism. She represented the perfect example of the trait.",
    "cantankerous": "The old supervisor snapped at simple questions and argued over trivial details. His _____ mood made teamwork difficult.",
    "belligerent": "Instead of discussing the issue, he shouted and threatened anyone who disagreed. His _____ behavior escalated the conflict quickly.",
    "polemical": "The essay attacked opposing views aggressively and seemed written to provoke debate. Its tone was sharply _____.",
    "discouraged": "After three rejections in a row, she felt _____ and considered quitting. Her motivation dropped because of repeated setbacks.",
    "pervasive": "Misinformation became so _____ that even casual conversations repeated it. It spread widely through the entire community.",
    "ubiquitous": "Smartphones are now so _____ that nearly everyone carries one. They appear everywhere in daily life.",
    "jeopardized": "By skipping the safety check, he _____ the entire operation. His shortcut put the outcome at risk.",
    "perilous": "Crossing the river during the storm was _____ and could easily have ended in disaster. The situation involved serious danger.",
    "didactic": "The novel felt more like a lesson than a story, constantly telling readers what to think. Its style was overtly _____.",
    "impertinent": "During the interview, he asked a rude personal question that was none of his business. The remark was _____.",
    "vigorous": "The protocol requires _____ mixing to dissolve the powder fully. Gentle stirring is not enough to achieve a uniform solution.",
    "deficient": "The diet was _____ in iron, leading to anemia over time. It lacked an essential nutrient rather than merely being unbalanced.",
    "breed": "If leaders reward dishonesty, they can _____ distrust throughout the organization. Their choices create and spread the problem.",
    "flamboyant": "He wore a neon suit and made grand gestures in every conversation. His style was deliberately _____.",
    "opulent": "The hotel lobby featured marble floors, chandeliers, and gold accents. The décor was unmistakably _____.",
    "inane": "The discussion drifted into _____ jokes that added nothing to the meeting. The comments were silly and empty of substance.",
    "dispense": "The machine can _____ exact doses without human measurement. It distributes medication precisely and consistently.",
    "tentative": "She offered a/an _____ plan, saying it could change once new data arrived. The proposal was provisional, not final.",
    "apprehensive": "Before the surgery, he felt _____ and kept asking about complications. He was anxious about what might go wrong.",
    "lucid": "Her explanation was _____, with clear steps and simple examples. Everyone understood the concept immediately.",
    "superfluous": "The report included a/an _____ appendix repeating tables already shown earlier. The extra section was unnecessary.",
    "devoid": "The hallway was completely _____ of light after the blackout. There w_
