{
  "title": "2000+Vocab_051-100",
  "word_bank": [
    "diffident", "prophetic", "conformity", "distribution", "authoritative",
    "conformist", "collaborating", "debilitate", "contentious", "reticent",
    "authoritarian", "truism", "prudence", "astounded", "munificent",
    "moderate", "mitigate", "callow", "duplicitous", "conducive",
    "notorious", "astute", "versatile", "derivative", "assumptive",
    "meticulous", "eulogy", "deride", "derive", "dogmatic",
    "liberal", "integrity", "insipid", "compelling", "proponent",
    "contempt", "incongruous", "exonerate", "renown", "enigma",
    "enigmatic", "esoteric", "embellishment", "denounce", "magnanimous",
    "benevolent", "distorted", "compound", "alleviate", "wary"
  ],
  "question_bank": {
    "diffident": "TESTEven when he knew the answer, he hesitated and spoke as if he doubted himself. His teacher described him as _____.",
    "prophetic": "Her warning about the company’s fragile finances sounded exaggerated at first. Two years later, it seemed _____ when the firm collapsed exactly as she predicted.",
    "distribution": "The report includes a histogram, not just an average value. It shows the full age _____ of the participants.",
    "authoritative": "The committee relied on a peer-reviewed clinical guideline rather than rumors online. They wanted a/an _____ source before changing the protocol.",
    "collaborating": "Two research groups are sharing data and writing one manuscript together. They are _____ on a multicenter study with a single protocol.",
    "debilitate": "Weeks of untreated infection left him too weak to walk up stairs. The illness continued to _____ him until he received proper treatment.",
    "contentious": "The proposal split the board into hostile factions. The meeting became so _____ that the chair had to call a recess.",
    "reticent": "When asked about the lawsuit, she gave only short, guarded replies. Her lawyer advised her to remain _____.",
    "authoritarian": "The regime censored newspapers and punished dissent. Under such a/an _____ government, criticism can be dangerous.",
    "prudence": "She refused to invest without reading every clause in the prospectus. Basic _____ guided her decision to avoid unnecessary risk.",
    "munificent": "The donor made an extraordinarily large cash donation that funded scholarships for a decade. The university called the gift _____.",
    "mitigate": "The lab installed backup power to reduce the impact of outages. These safeguards helped _____ the risk of data loss.",
    "duplicitous": "He praised the team in public but secretly undermined them in private emails. His coworkers realized he was _____.",
    "conducive": "The library’s quiet rules and good lighting help students focus. The environment is _____ to studying.",
    "notorious": "The nightclub is famous for aggressive bouncers and repeated safety violations. It is _____ in the neighborhood for trouble.",
    "astute": "She noticed the hidden fee before signing the contract. That kind of _____ attention saved her thousands of dollars.",
    "versatile": "This tool can cut wire, tighten screws, and open bottles. It’s remarkably _____ for something that fits in a pocket.",
    "derivative": "Critics said the sequel copied the original plot almost scene for scene. They dismissed it as _____.",
    "meticulous": "Every receipt was labeled, dated, and matched to an invoice in her spreadsheet. Her accountant is famously _____.",
    "eulogy": "At the funeral, his daughter spoke about his kindness and sacrifices. She delivered a moving _____.",
    "dogmatic": "He rejected all counterexamples and refused to reconsider his beliefs. His approach was rigidly _____.",
    "integrity": "She refused to alter the results to please her supervisor. Her scientific _____ mattered more than approval.",
    "incongruous": "The clown music made the memorial service feel wrong. The cheerful soundtrack was completely _____ with the solemn occasion.",
    "exonerate": "The new DNA test proved he could not have been at the scene. The evidence helped _____ him of the charges.",
    "enigma": "No one could explain why the system failed only on Tuesdays. The pattern remained a/an _____."
  }
}
