{
  "title": "2000+Vocab_001-050",
  "word_bank": [
    "undermine", "convention", "comprehensive", "beneficent", "foster",
    "distinction", "redundant", "diminish", "endorsed", "substantiated",
    "negligible", "characterize", "provocative", "advocate", "proliferate",
    "prosperous", "speculative", "disparage", "verbose", "discerning",
    "vindicated", "intricate", "tranquil", "belie", "obscure",
    "transient", "quirky", "tranquility", "trivial", "depict",
    "commentator", "detract", "expressive", "resilient", "ambivalent",
    "exacerbate", "perceive", "prosaic", "preserve", "engaging",
    "tenacious", "digressing", "scrutiny", "portray", "commend",
    "solicitous", "convoluted", "capricious", "inhibit", "altruistic"
  ],
 "question_bank": {
    "undermine": "The suspect tried to delete the audit logs to _____ the inquiry. Without those records, investigators could not verify the timeline.",
    "comprehensive": "The handbook is _____, covering enrollment, grading, and appeals in one place. Students rarely need to consult any other document.",
    "redundant": "Two separate paragraphs restate the same claim with different wording. The second one is _____ and should be cut.",
    "endorsed": "The policy was officially _____ by the board after a formal vote. It is now the organization’s stated position.",
    "substantiated": "At first, the claim sounded like a rumor. It was later _____ by time-stamped emails and signed receipts.",
    "negligible": "The measured concentration was below the instrument’s detection limit. For practical purposes, the exposure is _____.",
    "characterize": "The paper introduces a diagnostic framework to _____ the syndrome as primarily inflammatory rather than infectious. The framework depends on predefined thresholds rather than narrative description.",
    "proliferate": "One unverified post can _____ rapidly when people repost without checking sources. Within hours, the false story reached millions.",
    "speculative": "He offered a possible explanation but admitted he had no data yet. Until it is tested, the idea remains _____.",
    "disparage": "She criticized the method by pointing to specific flaws. She did not _____ the researchers personally or mock their intelligence.",
    "verbose": "The introduction takes three pages to say what could be said in five lines. It isn’t repetitive—just painfully _____ and packed with unnecessary wording.",
    "discerning": "A _____ editor notices weak evidence and vague claims immediately. That kind of reader is hard to impress with flashy wording alone.",
    "vindicated": "For months, she was blamed for the missing funds. When the bank corrected its error, she felt _____.",
    "intricate": "The microchip contains an _____ network of circuits arranged in multiple layers. Even small design changes require careful modeling.",
    "belie": "He joked and smiled throughout the interview. His calm manner seemed to _____ the gravity of the allegations.",
    "transient": "The dizziness lasted less than a minute and never returned. The doctor described it as _____.",
    "tranquility": "After the retreat, she finally felt a deep sense of _____. Even noisy streets seemed less stressful afterward.",
    "depict": "The figure is meant to _____ the experimental workflow step by step. Readers should understand the procedure just by looking at it.",
    "commentator": "During the debate, a _____ summarized each candidate’s claims and corrected factual errors. The audience relied on that running analysis.",
    "expressive": "Her face was unusually _____, showing excitement, worry, and relief in quick succession. You could read her mood without hearing a word.",
    "resilient": "The system is _____ by design: it reroutes traffic automatically after a router failure. Users often do not notice the outage at all.",
    "ambivalent": "He was _____ about accepting the offer. The salary appealed to him, but the commute worried him.",
    "exacerbate": "Skipping medication can _____ the disease and make symptoms harder to control. The flare-ups became more frequent after she stopped treatment.",
    "scrutiny": "The trial data came under intense _____. Independent reviewers checked the raw files for inconsistencies.",
    "inhibit": "A strong disinfectant can _____ bacterial growth on a surface. In lab tests, colonies failed to form after exposure."
  }
}
