{
  "title": "2000+Vocab_251-300",
  "word_bank": [
    "hostility", "conviction", "vital", "dedicate", "idiosyncratic",
    "hackneyed", "allege", "corroborated", "validated", "courteous",
    "indigenous", "ostentatious", "cerebral", "erudite", "administer",
    "inquiry", "foresee", "dissent", "dilatory", "methodology",
    "mimic", "exhausted", "amiable", "intellectual", "dilettante",
    "tyrannical", "dictatorial", "marginal", "conjectural", "methodical",
    "tribute", "refined", "paradox", "inscrutable", "fortify",
    "decry", "cosmopolitan", "sophisticated", "mandate", "tyrant",
    "fortitude", "negligent", "circumscribe", "confounded", "impartial",
    "parity", "dispassionate", "laconic", "somber", "zealous"
  ],
  "question_bank": {
    "hostility": "The negotiations broke down as each side began insulting the other. Open _____ replaced cooperation and made compromise impossible.",
    "conviction": "She spoke with unwavering confidence that the conclusion was correct. Her _____ came from years of evidence, not guesswork.",
    "vital": "Accurate dosing is _____ to patient safety in this protocol. If the amount is wrong, the entire treatment plan can fail.",
    "idiosyncratic": "His lab notes include strange symbols that only he understands. The system is so _____ that new trainees struggle to follow it.",
    "hackneyed": "The speech relied on tired phrases like “at the end of the day” and “think outside the box.” Reviewers dismissed it as _____.",
    "allege": "The report did not prove fraud, but it did _____ that records were altered. The wording made an accusation without presenting final proof.",
    "corroborated": "Her timeline was confirmed by security footage and two independent witnesses. The account was fully _____.",
    "validated": "A second dataset produced the same pattern, confirming the model’s accuracy. The replication _____ the original finding.",
    "courteous": "Even when criticized, he thanked the reviewer and responded politely. His reply remained consistently _____.",
    "indigenous": "The plant is _____ to this island and does not naturally grow elsewhere. It evolved here rather than being introduced from abroad.",
    "ostentatious": "He arrived in a gold-plated car and wore a watch covered in diamonds. The display was deliberately _____.",
    "cerebral": "The film focuses on ideas and moral dilemmas rather than action scenes. It’s a/an _____ drama meant to provoke thought.",
    "erudite": "Her lecture referenced primary sources in three languages and multiple historical debates. The audience admired her _____ command of the subject.",
    "administer": "Only trained staff are allowed to _____ the medication. The dose must be given correctly and on schedule.",
    "inquiry": "The university opened a formal _____ into the plagiarism allegation. Investigators collected documents and interviewed witnesses.",
    "foresee": "They failed to _____ the supply shortage and ordered materials too late. With better planning, the crisis could have been predicted.",
    "dissent": "The vote passed, but a written _____ was attached to the decision. A minority publicly recorded their disagreement with the majority.",
    "dilatory": "He kept requesting extensions and delaying meetings without good reason. His _____ tactics slowed the entire project.",
    "methodology": "The paper clearly explains its sampling, controls, and statistical tests. The _____ is detailed enough for replication.",
    "mimic": "The AI can _____ a human voice so closely that listeners think it’s real. It imitates the sound rather than creating a new one.",
    "amiable": "He greeted everyone warmly and made small talk with ease. His _____ manner put new students at ease immediately.",
    "dilettante": "She collects hobbies but never studies any one of them seriously. Friends tease her as a/an _____, not an expert.",
    "tyrannical": "He demanded obedience, punished minor mistakes, and allowed no debate. The manager’s _____ style drove employees away.",
    "marginal": "The new feature produced only a _____ improvement in speed. The change was small and barely noticeable.",
    "conjectural": "The theory sounds plausible, but it is still _____ without direct evidence. For now, it remains an educated guess.",
    "methodical": "He checks each step against a checklist and never skips the protocol. His approach is careful and _____.",
    "paradox": "It seems like a/an _____ that stricter rules sometimes create more cheating. The outcome contradicts what you would expect.",
    "inscrutable": "When asked why he resigned, he gave a calm smile and no explanation. His motives remained _____.",
    "fortify": "They added encryption and backups to _____ the system against attacks. The upgrades strengthened its defenses.",
    "decry": "Advocates _____ the policy as unjust and harmful. They publicly condemned it rather than quietly disagreeing.",
    "mandate": "The committee issued a/an _____ requiring all labs to store data for five years. It was an official order, not a suggestion."
  }
}
